app/views/tracks/show.html.erb

<% @notes.each do |note| %>
    <%= render 'note', note: note, user: User.find_by(id: note.user_id) %>
---
SELECT "notes".* FROM "notes" WHERE "notes"."track_id" = $1  [["track_id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]