app/controllers/albums_controller.rb

    def new
        @album = Album.new
        @bands = Band.all
---
SELECT "bands".* FROM "bands"

    def create
        @album = Album.new(album_params)
        @bands = Band.all
        if @album.save
---
SELECT "bands".* FROM "bands"
INSERT INTO "albums" ("band_id", "title", "year", "live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["band_id", 1], ["title", "asdqjwieq"], ["year", 2020], ["live", true], ["created_at", "2020-09-09 21:09:19.066814"], ["updated_at", "2020-09-09 21:09:19.066814"]]

    def edit
        @album = Album.find_by(id: params[:id])
        @bands = Band.all
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "bands".* FROM "bands"

    def show
        @album = Album.find_by(id: params[:id])
        @band = Band.find_by(id: @album.band_id)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def update
        @album = Album.find_by(id: params[:id])
        if @album.update(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "albums" SET "title" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["title", "Coca-cola"], ["updated_at", "2020-09-09 21:36:00.723827"], ["id", 2]]