app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "KDA"], ["created_at", "2020-09-09 19:06:33.524073"], ["updated_at", "2020-09-09 19:06:33.524073"]]
---
  def create
    @band = Band.new(name: params[:band][:name])
    if @band.save

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "RZA"], ["updated_at", "2020-09-09 19:10:27.349346"], ["id", 4]]
---
  def update
    @band = Band.find_by(id: params[:id])
    if @band.update(name: params[:band][:name])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 4]]
---
  def destroy
    @band = Band.find_by(id: params[:id])

    @band.destroy