app/controllers/notes_controller.rb

INSERT INTO "notes" ("user_id", "track_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 4], ["track_id", 2], ["body", "This is the best"], ["created_at", "2020-09-09 23:19:22.378487"], ["updated_at", "2020-09-09 23:19:22.378487"]]
---
    def create
        @note = Note.new(note_params)
        @note.user_id = current_user.id
        @note.save

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 1]]
---
    def destroy
        @note = Note.find_by(id: params[:id])
        if @note
            @note.destroy