app/controllers/tracks_controller.rb

    def new
        @track = Track.new
        @albums = Album.find_by(id: params[:album_id]).band.albums
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @track = Track.new(track_params)
        if @track.save
---
INSERT INTO "tracks" ("album_id", "title", "ord", "lyrics", "bonus", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["album_id", 1], ["title", "qiweiqnwe"], ["ord", 2], ["lyrics", "lwlqjweoqwje\r\n    "], ["bonus", true], ["created_at", "2020-09-09 22:22:52.271879"], ["updated_at", "2020-09-09 22:22:52.271879"]]

    def show
        @track = Track.find_by(id: params[:id])
        @album = Album.find_by(id: @track.album_id)
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def edit
        @track = Track.find_by(id: params[:id])
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def update
        @track = Track.find_by(id: params[:id])
        if @track.update(track_params)
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tracks" SET "lyrics" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3  [["lyrics", "Julia saved us\r\nJonathan and Derek got carried\r\n    \r\n    "], ["updated_at", "2020-09-09 23:56:37.528449"], ["id", 2]]

    def destroy
        @track = Track.find_by(id: params[:id])

        if @track
            @track.destroy
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 1]]